//--------------------------------------------------------------------------------------------------
// (С) 2020-2023 ООО «РМ Солюшн». Smart System Platform 3.1. Все права защищены.
// Описание: IModule – Интерфейс модуля, службы сервера прмложений.
//--------------------------------------------------------------------------------------------------
namespace RmSolution.Runtime
{
    public interface IModule
    {
        /// <summary> Статус выполнения.</summary>
        RuntimeStatus Status { get; }
    }
}