//--------------------------------------------------------------------------------------------------
// (С) 2020-2023 ООО «РМ Солюшн». RM System Platform 3.1. Все права защищены.
// Описание: IOServer – Интерфейс сервера ввода/вывода.
//--------------------------------------------------------------------------------------------------
namespace RmSolution.Runtime
{
    #region Using
    using RmSolution.Data;
    #endregion Using

    /// <summary> Интерфейс службы сбора данных, реестр оборудования. Сервер ввода/вывода.</summary>
    /// <remarks> В Системе должен быть только один экземпляр.</remarks>
    public interface IOServer
    {
        /// <summary> Реестр оборудования.</summary>
        /// <remarks> Возвращает копию реестра.</remarks>
        List<IDevice> Devices { get; }
    }
}
