//--------------------------------------------------------------------------------------------------
// (С) 2020-2023 ООО «РМ Солюшн». RM System Platform 3.1. Все права защищены.
// Описание: IOServer – Интерфейс сервера ввода/вывода.
//--------------------------------------------------------------------------------------------------
namespace RmSolution.Runtime
{
    #region Using
    using System.Data;
    #endregion Using

    /// <summary> Интерфейс сервера ввода/вывода.</summary>
    /// <remarks> Должен быть только один в Системе.</remarks>
    public interface IOServer
    {
    }
}
